routes/web.php

*/

Route::get('/', function () {
    $customers = Customer::all();
---
select * from `customers`