app/Http/Controllers/CustomersController.php

    public function create(Request $request)
    {
      $validatedDate = $request->validate([
        'name' => 'required|max:140',
      ]);

      $customer = new Customer();
      $customer->name = $request->name;
      $customer->type = $request->type;
      $customer->user_id = 0;

      $customer->save();
---
insert into `customers` (`name`, `type`, `user_id`, `updated_at`, `created_at`) values ('Isaac Peifer', 'both', '0', '2018-01-10 00:25:25', '2018-01-10 00:25:25')